app/controllers/articles_controller.rb

    def create
        @article = Article.new(article_params)
        @article.save
---
INSERT INTO "articles" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Will you still have a will to live after you become a web developer"], ["created_at", "2017-07-11 06:17:48.309422"], ["updated_at", "2017-07-11 06:17:48.309422"]]

    def update
        @article = Article.find(params[:id])
        @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "fasdfddqasxa"], ["body", "asfafdas"], ["updated_at", "2017-07-11 12:26:33.933369"], ["id", 12]]